project:01 Daily Expense Tracker + EDA Report

In [3]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

In [4]:
from io import StringIO

new_data = """date,category,item,amount,payment_method
2025-12-11,Food,Apple,1.2,Cash
2025-12-12,Transport,Bus_Ticket,2.5,Credit_Card
2025-12-13,Food,Banana,0.8,Debit_Card
2025-12-14,Entertainment,Movie_Ticket,12.0,Cash
2025-12-15,Food,Orange,1.5,Credit_Card"""

new_df = pd.read_csv(StringIO(new_data), parse_dates=['date'])
new_df

        date       category          item  amount payment_method
0 2025-12-11           Food         Apple     1.2           Cash
1 2025-12-12      Transport    Bus_Ticket     2.5    Credit_Card
2 2025-12-13           Food        Banana     0.8     Debit_Card
3 2025-12-14  Entertainment  Movie_Ticket    12.0           Cash
4 2025-12-15           Food        Orange     1.5    Credit_Card

In [19]:
new_df.head()

        date       category          item  amount payment_method
0 2025-12-11           Food         Apple     1.2           Cash
1 2025-12-12      Transport    Bus_Ticket     2.5    Credit_Card
2 2025-12-13           Food        Banana     0.8     Debit_Card
3 2025-12-14  Entertainment  Movie_Ticket    12.0           Cash
4 2025-12-15           Food        Orange     1.5    Credit_Card

In [5]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            5 non-null      datetime64[ns]
 1   category        5 non-null      object
 2   item            5 non-null      object
 3   amount          5 non-null      float64
 4   payment_method  5 non-null      object
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 332.0+ bytes

In [6]:
new_df.describe()

                      date     amount
count                    5   5.000000
mean   2025-12-13 00:00:00   3.600000
min    2025-12-11 00:00:00   0.800000
25%    2025-12-12 00:00:00   1.200000
50%    2025-12-13 00:00:00   1.500000
75%    2025-12-14 00:00:00   2.500000
max    2025-12-15 00:00:00  12.000000
std                    NaN   4.737615

In [7]:
new_df.isnull().sum()

date              0
category          0
item              0
amount            0
payment_method    0
dtype: int64

In [10]:
new_df.columns

Index(['date', 'category', 'item', 'amount', 'payment_method'], dtype='object')

In [11]:
new_df['category'].value_counts()

category
Food             3
Transport        1
Entertainment    1
Name: count, dtype: int64

In [12]:
new_df['item'].unique()

array(['Apple', 'Bus_Ticket', 'Banana', 'Movie_Ticket', 'Orange'],
      dtype=object)

In [13]:
new_df.head()

        date       category          item  amount payment_method
0 2025-12-11           Food         Apple     1.2           Cash
1 2025-12-12      Transport    Bus_Ticket     2.5    Credit_Card
2 2025-12-13           Food        Banana     0.8     Debit_Card
3 2025-12-14  Entertainment  Movie_Ticket    12.0           Cash
4 2025-12-15           Food        Orange     1.5    Credit_Card

In [17]:
new_df['amount'].nunique()

5

In [18]:
new_df['payment_method'].unique()

array(['Cash', 'Credit_Card', 'Debit_Card'], dtype=object)